test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:3200
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 2
      name: Warm up phase
    - duration: 60
      arrivalRate: 1
      rampTo: 2
      name: Ramp up load
    - duration: 30
      arrivalRate: 2
      rampTo: 3
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
        - get:
            url: "/api/content/model?locale=en&slug=hotels-root"
        count: 100